const thai = {
  language: {
    label: 'Thai',
    locale: 'th'
  },
  seo: {
    keywords:
      'แบบทดสอบบุคลิกภาพใหญ่ 5 อย่าง, แบบทดสอบบุคลิกภาพใหญ่ห้าอย่าง, บุคลิกภาพ 5 องค์ประกอบ, บุคลิกภาพ 5 ประการ, แบบทดสอบบุคลิกภาพ, b5 test, bigfive test, personality traits, bigfive, compare, free, jordan peterson'
  },
  frontpage: {
    seo: {
      title: 'แบบทดสอบบุคลิกภาพ Big Five',
      description:
        'ทำแบบทดสอบบุคลิกภาพใหญ่ 5 อย่าง แบบโอเพ่นซอร์สฟรี เรียนรู้ที่จะรู้จักลักษณะบุคลิกภาพของคุณและเปรียบเทียบตัวเองกับคู่ของคุณ เพื่อนร่วมงาน เพื่อน หรือครอบครัวของคุณ'
    },
    title: 'แบบทดสอบบุคลิกภาพใหญ่ 5 อย่าง',
    call_to_action: 'ทําการทดสอบฟรีตอนนี้',
    no_registration: '* ไม่จำเป็นต้องลงทะเบียน',
    tests_taken: 'มีผู้เข้าร่วมการทดสอบมากกว่า <green>{n}</green> คน',
    compare: {
      title: 'เปรียบเทียบตัวเองกับผู้อื่น',
      action: 'เปรียบเทียบเลย',
      text: 'เปรียบเทียบผลลัพธ์ของคุณกับคู่รัก เพื่อนร่วมงาน เพื่อน หรือสมาชิกในครอบครัว เพื่อดูว่าคุณแตกต่างกันอย่างไรในบุคลิกภาพทั้งห้ามิติ'
    },
    share: 'แบ่งปันและเรียนรู้ความเข้ากันได้ของคุณกับเพื่อนของคุณ',
    cards: {
      open: {
        title: 'โอเพน',
        text: 'นี่คือโครงการโอเพนซอร์สภายใต้ใบอนุญาต MIT'
      },
      free: {
        title: 'ฟรี',
        text: 'การทดสอบนี้ไม่มีค่าใช้จ่ายใดๆ'
      },
      scientific: {
        title: 'วิทยาศาสตร์',
        text: 'บุคลิกภาพใหญ่ 5 อย่าง เป็นแบบจำลองทางจิตวิทยาที่เชื่อถือได้และสามารถตรวจสอบได้ทางวิทยาศาสตร์'
      },
      translated: {
        title: 'แปลภาษา',
        text: 'ได้รับการแปลเป็นภาษาต่างๆมากกว่า 20 ภาษา คุณสามารถช่วยได้ <a href="https://b5.translations.alheimsins.net/" rel="noreferrer" target="blank">ที่นี่</a>!'
      }
    },
    description: {
      top: 'ทำความเข้าใจตัวเองให้ดียิ่งขึ้นผ่าน<wiki>ลักษณะบุคลิกภาพใหญ่ทั้งห้า</wiki>',
      wikipedia: 'อ่านเรื่องลักษณะบุคลิกภาพใหญ่ทั้งห้าในวิกิพีเดีย',
      subtop: 'นี่',
      subtop2:
        ' เป็นแบบจำลองทางจิตวิทยาที่เชื่อถือได้และสามารถตรวจสอบได้ทางวิทยาศาสตร์เพื่อวัดบุคลิกภาพ',
      reference: `การทดสอบและการประเมินผลสําหรับเว็บไซต์นี้รวบรวมจาก
<a href="http://ipip.ori.org" rel="noopener" target="_blank">ipip.ori.org</a>,
ชุดวัดบุคลิกภาพจาก <i>Johnson's (2014) 120-item IPIP NEO-PI-R</i>.`,
      info: 'แบบทดสอบนี้มี 120 ข้อ และใช้เวลาทำประมาณ 10 นาที',
      result:
        'หลังจากที่คุณทําการทดสอบเสร็จแล้ว คุณจะได้รับรายงานบุคลิกภาพโดยละเอียดในปัจจัยต่อไปนี้:',
      tests_taken: 'การทดสอบที่ดำเนินการไปแล้ว'
    }
  },
  about: {
    seo: {
      title: 'เกี่ยวกับทีมบิ๊กไฟว์',
      description:
        'บิ๊กไฟว์ มีทีมที่กระตือรือร้นและมีส่วนร่วมอย่างมาก ซึ่งพยายามอย่างต่อเนื่องที่จะผลักดัน บิ๊กไฟว์ ไปข้างหน้า.'
    }
  },
  toolbar: {
    home: 'หน้าหลัก',
    result: 'ผลลัพธ์',
    compare: 'การเปรียบเทียบ',
    personality: 'บุคลิกภาพ',
    articles: 'บทความ',
    about: 'เกี่ยวกับเรา',
    see_results: 'ดูผลลัพธ์ของคุณ',
    compare_with: 'เปรียบเทียบกับคนอื่นๆ'
  },
  facets: {
    openness_to_experience: {
      title: 'การเปิดรับประสบการณ์'
    },
    conscientiousness: {
      title: 'ความพิถีพิถัน'
    },
    extraversion: {
      title: 'ความสนใจต่อสิ่งภายนอก'
    },
    agreeableness: {
      title: 'ความยินยอมเห็นใจ'
    },
    neuroticism: {
      title: 'ความไม่เสถียรทางอารมณ์'
    }
  },
  common: {
    and: 'และ',
    pages: 'หน้า',
    languages: 'ภาษา',
    save: 'บันทึก',
    close: 'ปิด'
  },
  form: {
    information: 'ข้อมูล',
    informationText: 'เราใช้ข้อมูลที่คุณให้มาเพื่อให้คุณ',
    mostAccurate: 'ได้ผลลัพธ์ที่ถูกต้องที่สุด',
    readMoreAbout: 'อ่านเพิ่มเติมเกี่ยวกับ',
    nextButton: 'โอเค คำถามต่อไป',
    declineButton: 'ดำเนินการต่อโดยไม่ต้องแชร์',
    prefferedLanguage: 'ภาษาที่ฉันต้องการคือ',
    selectLanguage: 'เลือกภาษา',
    iama: 'ฉันคือ',
    male: 'ผู้ชาย',
    female: 'ผู้หญิง',
    age: 'อายุ',
    iam: 'ฉันอายุ',
    yearsOld: 'ปี',
    ageWarning: 'คุณต้องมีอายุ 16 ปีขึ้นไป',
    language: 'ภาษา',
    gender: 'เพศ',
    confirmInfo: 'ยืนยันข้อมูล',
    confirm: 'ยืนยัน',
    toTestButton: 'เอาล่ะ พาฉันไปทดสอบ'
  },
  test: {
    next: 'ต่อไป',
    back: 'ข้อก่อนหน้า',
    more: 'เพิ่มเติม',
    seeResults: 'ดูผลลัพธ์'
  },
  big_five: {
    title: 'บิ๊กไฟว์ คืออะไร?',
    seo: {
      title: 'บิ๊กไฟว์ คืออะไร?',
      description: 'อ่านเพิ่มเติมเกี่ยวกับ บิ๊กไฟว์'
    }
  },
  openness_to_experience: {
    title: 'การเปิดรับประสบการณ์',
    seo: {
      title: 'ภาพรวมของปัจจัยการเปิดรับประสบการณ์',
      description: 'อ่านเพิ่มเติมเกี่ยวกับปัจจัยการเปิดรับประสบการณ์ในโมเดล b5'
    }
  },
  conscientiousness: {
    title: 'ความพิถีพิถัน ',
    seo: {
      title: 'ภาพรวมของปัจจัยความพิถีพิถัน',
      description: 'อ่านเพิ่มเติมเกี่ยวกับปัจจัยความพิถีพิถันในโมเดล b5'
    }
  },
  extraversion: {
    title: 'ความสนใจต่อสิ่งภายนอก',
    seo: {
      title: 'ภาพรวมของปัจจัยความสนใจต่อสิ่งภายนอก',
      description: 'อ่านเพิ่มเติมเกี่ยวกับปัจจัยความสนใจต่อสิ่งภายนอกในโมเดล b5'
    }
  },
  agreeableness: {
    title: 'ความยินยอมเห็นใจ',
    seo: {
      title: 'ภาพรวมของปัจจัยความยินยอมเห็นใจ',
      description: 'อ่านเพิ่มเติมเกี่ยวกับปัจจัยความยินยอมเห็นใจในโมเดล b5'
    }
  },
  neuroticism: {
    title: 'ความไม่เสถียรทางอารมณ์',
    seo: {
      title: 'ภาพรวมของปัจจัยความไม่เสถียรทางอารมณ์',
      description:
        'อ่านเพิ่มเติมเกี่ยวกับปัจจัยความไม่เสถียรทางอารมณ์ในโมเดล b5'
    }
  },
  getCompare: {
    title: 'เปรียบเทียบบุคคลหรือทีม',
    description1:
      'เปรียบเทียบผลลัพธ์จากการทดสอบบุคลิกภาพใหญ่ 5 อย่าง กับหลายๆ คน',
    description2: 'พิมพ์ ID ที่คุณได้รับจากผลการทดสอบ เช่น',
    description3: 'ในช่องใส่ ID',
    needToAddPeople: 'คุณต้องเพิ่มบุคคลคนอื่นเพื่อเปรียบเทียบ',
    addAnother: 'เพิ่มบุคคลอื่น',
    addPerson: 'เพิ่มบุคคล',
    comparePeople: 'เปรียบเทียบ',
    nameOfPerson: 'ชื่อของบุคคลนี้',
    urlOrId: 'URL หรือ ID สำหรับการเปรียบเทียบ',
    name: 'ชื่อ'
  },
  results: {
    overview: 'ภาพรวม',
    all: 'ทั้งหมด',
    selectDomain: 'เลือกลักษณะนิสัย',
    readMore: 'อ่านเพิ่มเติม',
    readLess: 'แสดงน้อยลง',
    theBigFive: 'ปัจจัย 5 อย่าง',
    score: 'คะแนน',
    notice:
      '<important>สำคัญ!</important> บันทึก ID ต่อไปนี้ไว้ เพื่อให้คุณกลับมาดูผลลัพธ์ภายหลังหรือ<compare>เปรียบเทียบตัวเองกับผู้อื่น</compare>ได้',
    seo: {
      title: 'ผลลัพธ์ของฉันจากการทดสอบบุคลิกภาพใหญ่ 5 อย่าง',
      description:
        'ดูบุคลิกภาพของฉันและเปรียบเทียบตัวเองในห้าปัจจัยต่อไปนี้: ความไม่เสถียรทางอารมณ์, การเปิดรับประสบการณ์ , ความพิถีพิถัน, ความสนใจต่อสิ่งภายนอก, ความยินยอมเห็นใจ'
    }
  },
  getResult: {
    result: 'ผลลัพธ์',
    explanation:
      'หากคุณบันทึก ID ผลลัพธ์หลังทำแบบทดสอบ ให้กรอก ID ด้านล่างเพื่อดูผลลัพธ์',
    idInput: 'ในช่องใส่ ID',
    urlOrId: 'URL หรือ ID ของผลลัพธ์ของคุณ',
    getResult: 'รับผลทดสอบ',
    viewPrevious: 'ดูผลลัพธ์ที่ผ่านมา'
  },
  shareLinks: {
    copyLink: 'คัดลอกลิงค์ไปยังคลิปบอร์ด',
    shareFacebook: 'แชร์ไปยัง Facebook',
    shareTwitter: 'แชร์ไปยัง Twitter',
    copiedLink: 'คัดลอกลิงค์',
    shareResults: 'แชร์ผลลัพธ์ของคุณ!'
  }
};

export default thai;
